In [1]:
import pandas as pd
data=[1,3,5,7,9]
ser1=pd.Series(data)
print(ser1)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
type(ser1)

pandas.core.series.Series

In [9]:
ser1=pd.Series(data,index=['a','b','c','d','e'])
print(ser1)

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [12]:
# create dataframe using list 
import pandas as pd
data=[1,2,3,4,5,6]
df=pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [14]:
#create dataframe using dictionary
dic ={'fruits' :['panana','mango','apple'] , 'count' : [10,20,30]}
df = pd.DataFrame(dic)
print(df)

   fruits  count
0  panana     10
1   mango     20
2   apple     30

In [17]:
#creating dataframe using series
ser=pd.Series([6,10] , index = ['A','B'])
df = pd.DataFrame(ser)
print(ser)

A     6
B    10
dtype: int64

In [18]:
#creating dataframe using series
ser=pd.Series([6,10] )
df = pd.DataFrame(ser)
print(ser)

0     6
1    10
dtype: int64

In [23]:
#creating dataframe using numpy_array
import numpy as np
numpyarr =([['Ahmed','Mazen'],[50000 ,100000]])
df = pd.DataFrame({'Name':numpyarr[0] , 'Salary' : numpyarr[1]})
print(df)

    Name  Salary
0  Ahmed   50000
1  Mazen  100000

In [30]:
#merge dataframe operation
import pandas as pd
players =['player1','player2','player3']
points =[10,15,12]
titles =['Football','Basketball','Amercanball']
df1 = pd.DataFrame({'PLAYERS':players , 'POINTS':points , 'TITLES':titles})
df1

   PLAYERS  POINTS       TITLES
0  player1      10     Football
1  player2      15   Basketball
2  player3      12  Amercanball

In [33]:
players=['Ahmed','Amr','Mazen']
points=[10,40,30]
titles=['Football','Basketball','Amercanball']
df2=pd.DataFrame({'Names':players , 'POINTS':points , 'Game':titles}) 
df2

   Names  POINTS         Game
0  Ahmed      10     Football
1    Amr      40   Basketball
2  Mazen      30  Amercanball

In [34]:
#inner merge
df1.merge(df2 , on ='POINTS' , how = 'inner')

   PLAYERS  POINTS    TITLES  Names      Game
0  player1      10  Football  Ahmed  Football

In [35]:
#left merge
df1.merge(df2 , on = 'POINTS' , how = 'left')

   PLAYERS  POINTS       TITLES  Names      Game
0  player1      10     Football  Ahmed  Football
1  player2      15   Basketball    NaN       NaN
2  player3      12  Amercanball    NaN       NaN

In [36]:
#right merge
df1.merge(df2 , on ='POINTS' , how = 'right')

   PLAYERS  POINTS    TITLES  Names         Game
0  player1      10  Football  Ahmed     Football
1      NaN      40       NaN    Amr   Basketball
2      NaN      30       NaN  Mazen  Amercanball

In [53]:
# join dataframe operation 
import pandas as pd
players =['player1','player2','player3']
points =[10,15,12]
titles =['Football','Basketball','Amercanball']
df4 = pd.DataFrame({'PLAYERS':players , 'POINTS':points , 'TITLES':titles } , index=['A','B','C'])
df4

   PLAYERS  POINTS         Game
A  player1      10     Football
B  player2      15   Basketball
C  player3      12  Amercanball

In [68]:
players=['Ahmed','Amr','Mazen']
points=[10,40,30]
titles=['Football','Basketball','Amercanball']
df5=pd.DataFrame({'Names':players , 'POINTss':points , 'Games':titles} , index=['A','B','D']) 
df5

   Names  POINTss        Games
A  Ahmed       10     Football
B    Amr       40   Basketball
D  Mazen       30  Amercanball

In [67]:
#inner join
df4.join(df5 , how = 'inner')

   PLAYERS  POINTS         Game  Names  POINTss        Games
A  player1      10     Football  Ahmed       10     Football
B  player2      15   Basketball    Amr       40   Basketball
C  player3      12  Amercanball  Mazen       30  Amercanball

In [65]:
#left join
df4.join(df5 , how = 'left')

   PLAYERS  POINTS         Game  Names  POINTss        Games
A  player1      10     Football  Ahmed       10     Football
B  player2      15   Basketball    Amr       40   Basketball
C  player3      12  Amercanball  Mazen       30  Amercanball

In [63]:
#right join
df4.join(df5 , how = 'right')

   PLAYERS  POINTS         Game  Names  POINTss        Games
A  player1      10     Football  Ahmed       10     Football
B  player2      15   Basketball    Amr       40   Basketball
C  player3      12  Amercanball  Mazen       30  Amercanball

In [69]:
#outer join
df4.join(df5 , how = 'outer')

   PLAYERS  POINTS         Game  Names  POINTss        Games
A  player1    10.0     Football  Ahmed     10.0     Football
B  player2    15.0   Basketball    Amr     40.0   Basketball
C  player3    12.0  Amercanball    NaN      NaN          NaN
D      NaN     NaN          NaN  Mazen     30.0  Amercanball

In [73]:
pd.concat([df4,df5])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          Game        Games  Names  PLAYERS  POINTS  POINTss
A     Football          NaN    NaN  player1    10.0      NaN
B   Basketball          NaN    NaN  player2    15.0      NaN
C  Amercanball          NaN    NaN  player3    12.0      NaN
A          NaN     Football  Ahmed      NaN     NaN     10.0
B          NaN   Basketball    Amr      NaN     NaN     40.0
D          NaN  Amercanball  Mazen      NaN     NaN     30.0